Revit 2027 API
StairsPath.TextOrientation Property
 The orientation of stair up and down text.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StairsTextOrientation TextOrientation { get; set; }
Public Property TextOrientation As StairsTextOrientation
	Get
	Set
public:
property StairsTextOrientation TextOrientation {
	StairsTextOrientation get ();
	void set (StairsTextOrientation value);
}
member TextOrientation : StairsTextOrientation with get, set
Property Value
StairsTextOrientation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace